Repository: leduyquang753/CalcIt
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: vi_vn

# appDescription
source: An app that calculates mathematical expressions.
vi_vn: Một ứng dụng có thể tính các biểu thức toán học.

# buttonAddVariable.ToolTipService.ToolTip
source: Add a new variable to watch
vi_vn: Thêm biến để theo dõi

# buttonCalculate.Content
source: Calculate
vi_vn: Tính

# buttonCalculateSmall.ToolTipService.ToolTip
source: Calculate
vi_vn: Tính

# buttonClear.ToolTipService.ToolTip
source: Clear output
vi_vn: Xóa các kết quả

# buttonCloseSettings.ToolTipService.ToolTip
source: Close
vi_vn: Đóng

# buttonEditStartupExpressions.Content
source: Edit
vi_vn: Sửa

# buttonHelp.ToolTipService.ToolTip
source: Help and about
vi_vn: Trợ giúp và thông tin

# buttonRestartApp.Content
source: Restart app
vi_vn: Mở lại ứng dụng

# buttonSettings.ToolTipService.ToolTip
source: Settings
vi_vn: Cài đặt

# buttonViewVariables.ToolTipService.ToolTip
source: View variables
vi_vn: Xem các biến

# checkCalculateLastIfEmpty.Header
source: Calculate the last expression if input is empty
vi_vn: Tính biểu thức trước đó khi hộp nhập trống

# checkCalculateLastIfEmpty.OffContent
source: Disabled
vi_vn: Tắt

# checkCalculateLastIfEmpty.OnContent
source: Enabled
vi_vn: Bật

# checkEnforceDecimalSeparator.Content
source: Enforce
vi_vn: Bắt buộc

# checkUseOldOutputBox.Content
source: Use plain text box for output
vi_vn: Dùng hộp văn bản thuần để hiện kết quả

# commandCopyAll.Text
source: Copy
vi_vn: Chép

# commandCopyExpression.Text
source: Only expression
vi_vn: Chỉ biểu thức

# commandCopyResult.Text
source: Only result
vi_vn: Chỉ kết quả

# dialogHelpAndAbout.PrimaryButtonText
source: Close
vi_vn: Đóng

# dialogHelpAndAbout.Title
source: Help and about
vi_vn: Trợ giúp & thông tin

# error.braceInvolved
source: Brace is involved as an operator. This is a BUG, report it to the author.
vi_vn: Dấu ngoặc bị xử lí như toán tử. Đây là LỖI CHƯƠNG TRÌNH, hãy thông báo tác giả.

# error.divisionByZero
source: Division by zero.
vi_vn: Chia cho không.

# error.header
source: ERROR:
vi_vn: LỖI:

# error.headerStartup.xy
source: ERROR in startup expressions file at ({0}; {1}):
vi_vn: LỖI trong tệp biểu thức khởi động tại ({0}; {1}):

# error.headerStartup.y
source: ERROR in startup expressions file at line {0}:
vi_vn: LỖI trong tệp biểu thức khởi động tại dòng {0}:

# error.invalidArccosArg
source: Invalid arccosine function argument.
vi_vn: Tham số hàm arccosine không hợp lệ.

# error.invalidArcsinArg
source: Invalid arcsine function argument.
vi_vn: Tham số hàm arcsine không hợp lệ.

# error.invalidCombinationNegativeArgs
source: Combination function's arguments must not be negative.
vi_vn: Các tham số hàm tổ hợp không được âm.

# error.invalidCombinationNumArgs
source: Combination function must receive exactly 2 arguments.
vi_vn: Hàm tổ hợp phải nhận đúng 2 tham số.

# error.invalidComparisonNumArgs
source: Comparison function must receive at least 2 arguments.
vi_vn: Hàm so sánh phải nhận ít nhất 2 tham số.

# error.invalidFactorialArg
source: Factorial function's argument must not be negative.
vi_vn: Tham số hàm giai thừa không được âm.

# error.invalidIfNumArgs
source: Conditional function only takes up to 3 arguments.
vi_vn: Hàm điều kiện chỉ nhận tối đa 3 tham số.

# error.invalidLogBase
source: Logarithm function's base must be positive.
vi_vn: Cơ số hàm logarid phải dương.

# error.invalidLogInput
source: Logarithm function's input must be positive.
vi_vn: Tham số vào hàm logarid phải dương.

# error.invalidNotNumArgs
source: Not function only takes 1 argument.
vi_vn: Hàm đảo chỉ nhận một tham số.

# error.invalidPermutationNegativeArgs
source: Permutation function's arguments must not be negative.
vi_vn: Các tham số hàm hoán vị không được âm.

# error.invalidPermutationNumArgs
source: Permutation function must receive exactly 2 arguments.
vi_vn: Hàm hoán vị phải nhận đúng 2 tham số.

# error.invalidRandomNoIntegerBetween
source: Random integer function's arguments have no integers in between.
vi_vn: Không có số nguyên nào nằm ở giữa các tham số cho hàm số nguyên ngẫu nhiên.

# error.invalidRandomNumArgs
source: Random function only takes up to 2 arguments.
vi_vn: Hàm ngẫu nhiên chỉ nhận tối đa 2 tham số.

# error.invalidVariable
source: Invalid variable name: "{0}". It must not start with a digit.
vi_vn: Tên biến không hợp lệ: "{0}". Nó không được bắt đầu bằng chữ số.

# error.level0Root
source: Level 0 root occured.
vi_vn: Căn bậc 0 đã xảy ra.

# error.nonAlphanumericVariableName
source: Invalid variable name: "{0}". It must only consist of alphanumeric characters and underscores.
vi_vn: Tên biến không hợp lệ: "{0}". Nó chỉ được có các chữ cái, chữ số và gạch dưới.

# error.nothingToCalculate
source: There is nothing to calculate.
vi_vn: Không có gì để tính.

# error.numberOutOfRange
source: Numbers involved in the calculation are too large or too small.
vi_vn: Các con số trong phép tính quá lớn hoặc quá nhỏ.

# error.reservedVariable
source: Ans and PreAns are reserved variables and cannot be set.
vi_vn: Ans và PreAns là các biến dành riêng và không thể gán.

# error.trailingSign
source: Trailing positive/negative sign.
vi_vn: Dư dấu âm/dương ở cuối biểu thức.

# error.unexpectedClosingBrace
source: Unexpected closing brace.
vi_vn: Dấu đóng ngoặc ở vị trí không hợp lệ.

# error.unexpectedDecimalSeparator
source: Unexpected decimal separator.
vi_vn: Dấu thập phân ở vị trí không hợp lệ.

# error.unexpectedDigit
source: Unexpected digit.
vi_vn: Chữ số ở vị trí không hợp lệ.

# error.unexpectedEnd
source: Unexpected end.
vi_vn: Biểu thức kết thúc bất ngờ.

# error.unexpectedEqual
source: Unexpected equal sign.
vi_vn: Dấu bằng ở vị trí không hợp lệ.

# error.unexpectedOperand
source: Unexpected operand.
vi_vn: Toán tử ở vị trí không hợp lệ.

# error.unexpectedPercent
source: Unexpected percent sign.
vi_vn: Dấu phần trăm ở vị trí không hợp lệ.

# error.unexpectedSemicolon
source: Unexpected semicolon.
vi_vn: Dấu chấm phẩy ở vị trí không hợp lệ.

# error.unexpectedThousandSeparator
source: Unexpected thousand separator.
vi_vn: Dấu phân lớp ở vị trí không hợp lệ.

# error.unknownFunction
source: Unknown function: "{0}".
vi_vn: Hàm không xác định: "{0}".

# error.unknownSymbol
source: Unknown symbol.
vi_vn: Kí tự không xác định.

# error.unmatchingBraces
source: Unmatching braces.
vi_vn: Dấu mở và đóng ngoặc không khớp nhau.

# error.unsupportedExponentiation
source: Unsupported exponentiation: {0} ^ {1}.
vi_vn: Lũy thừa không được hỗ trợ: {0} ^ {1}.

# error.variableNotSet
source: Variable "{0}" is not set.
vi_vn: Biến "{0}" chưa được gán.

# getVarString.emptyVariableName
source: [Empty variable name.]
vi_vn: [Tên biến trống.]

# getVarString.invalidVariableName
source: [Invalid variable name.]
vi_vn: [Tên biến không hợp lệ.]

# getVarString.numberOutOfRange
source: [Number too large or small.]
vi_vn: [Số quá lớn hoặc nhỏ.]

# getVarString.variableNotSet
source: [Variable not set.]
vi_vn: [Biến chưa được gán.]

# inputBox.PlaceholderText
source: Enter any expresssion...
vi_vn: Nhập bất kì biểu thức nào...

# labelAngleUnit.Text
source: Angle unit
vi_vn: Đơn vị góc

# labelDecimalSeparator.Text
source: Decimal separator
vi_vn: Dấu thập phân

# labelMoreComingSoon.Text
source: More coming soon...
vi_vn: Còn nữa, sẽ có sau...

# labelMultiplicationSign.Text
source: Multiplication sign
vi_vn: Dấu nhân

# labelStartupExpressions.Text
source: Startup expressions
vi_vn: Các biểu thức khởi động

# labelThousandSeparator.Text
source: Thousand separator
vi_vn: Dấu phân lớp

# labelUndefinedVariablesHandling.Text
source: When trying to retrieve undefined variables
vi_vn: Khi thử lấy giá trị các biến chưa gán

# labelVariables.Text
source: Variables
vi_vn: Danh sách biến

# linkDocumentation.Content
source: CalcIt documentation
vi_vn: Tài liệu hướng dẫn cho CalcIt

# linkLicense.Content
source: License
vi_vn: Điều khoản

# linkRepository.Content
source: GitHub repository
vi_vn: Mã nguồn trên GitHub

# outputBox.PlaceholderText
source: Output of the app will display here.
vi_vn: Kết quả xử lí của ứng dụng sẽ hiện ở đây.

# radioAngleUnitDegree.Content
source: Degrees
vi_vn: Độ

# radioAngleUnitGrad.Content
source: Gradians
vi_vn: Gradian

# radioAngleUnitRadian.Content
source: Radians
vi_vn: Radian

# radioDecimalSeparatorComma.Content
source: Comma
vi_vn: Phẩy

# radioDecimalSeparatorDot.Content
source: Dot
vi_vn: Chấm

# radioDefaultUndefinedAs0.Content
source: Return 0
vi_vn: Trả về 0

# radioMultiplicationAsterisk.Content
source: Asterisk
vi_vn: Sao

# radioMultiplicationDot.Content
source: Dot
vi_vn: Chấm

# radioRaiseErrorForUndefinedVariables.Content
source: Raise error
vi_vn: Báo lỗi

# radioThousandSeparatorDot.Content
source: Dot / Comma
vi_vn: Chấm / Phẩy

# radioThousandSeparatorSpace.Content
source: Space
vi_vn: Cách

# settingsTitle.Text
source: Settings
vi_vn: Cài đặt

# sliderExpressionsInHistory.Header
source: Maximum expressions in history
vi_vn: Số biểu thức tối đa trong lịch sử

# startupExpressionsDescription.Text
source: Press the button below to edit the startup expressions. After editing, restart the app to apply changes.
vi_vn: Nhấn nút bên dưới để sửa các biểu thức khởi động. Khi sửa xong, khởi động lại ứng dụng để áp dụng các thay đổi.

# text.newOutputNumberOutOfRange
source: The result is too large or too small to be displayed.
vi_vn: Kết quả tính quá lớn hoặc nhỏ để hiển thị.

# text.oldOutputNumberOutOfRange
source: Number is too large or small.
vi_vn: Số quá lớn hoặc nhỏ.

# textEmptyOutputPanel.Text
source: Output of the app will display here.
vi_vn: Kết quả xử lí của ứng dụng sẽ hiện ở đây.

# textVersion
source: CalcIt UWP version {0}, build {1}
vi_vn: CalcIt UWP phiên bản {0}, bản dựng số {1}

# variableViewNameBox.PlaceholderText
source: Name
vi_vn: Tên

# variableViewRemoveButton.ToolTipService.ToolTip
source: Remove
vi_vn: Bỏ khỏi danh sách

# variableViewValueBox.PlaceholderText
source: Value
vi_vn: Giá trị
